tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "AdoptOpenJDK/openjdk"

# Applications

cask "google-chrome"
cask "iterm2"
cask "slack"
cask "evernote"
cask "between"
cask "sublime-text"

mas "1Password 7", id: 1333542190
mas "KakaoTalk", id: 869223134
mas "BetterSnapTool", id: 417375580

# Development

brew "git"
brew "python"
brew "wget"
brew "swiftlint" # Xcode dependent
brew "node"

cask "homebrew/cask-fonts/font-d2coding"
cask "adoptopenjdk8"
cask "android-sdk"
cask "android-ndk"
cask "android-platform-tools"
cask "android-studio"
cask "intellij-idea-ce"
cask "sourcetree"
